import matplotlib.pyplot as plt
import networkx as nx

# Створення графа
G = nx.Graph()

# Додавання вузлів (станцій)
stations = ['Майдан Незалежності', 'Хрещатик', 'Арсенальна', 'Університет', 'Вокзальна', 'Політехнічний інститут',
            'Шулявська', 'Театральна', 'Золоті ворота', 'Палац спорту', 'Льва Толстого', 'Олімпійська',
            'Площа Льва Толстого', 'Палац Україна', 'Либідська']
G.add_nodes_from(stations)

# Додавання ребер (доріг або маршрутів між станціями)
routes = [
    ('Майдан Незалежності', 'Хрещатик'),
    ('Хрещатик', 'Арсенальна'),
    ('Майдан Незалежності', 'Театральна'),
    ('Театральна', 'Золоті ворота'),
    ('Золоті ворота', 'Університет'),
    ('Університет', 'Вокзальна'),
    ('Вокзальна', 'Політехнічний інститут'),
    ('Політехнічний інститут', 'Шулявська'),
    ('Театральна', 'Палац спорту'),
    ('Палац спорту', 'Льва Толстого'),
    ('Льва Толстого', 'Олімпійська'),
    ('Олімпійська', 'Палац Україна'),
    ('Палац Україна', 'Либідська')
]
G.add_edges_from(routes)

# Візуалізація графа
pos = nx.spring_layout(G)  # Позиціонування вузлів
nx.draw(G, pos, with_labels=True, node_color='skyblue', node_size=2000, edge_color='gray', font_size=10,
        font_weight='bold')
plt.title("Транспортна мережа Києва")
plt.show()

# Кількість вершин та ребер
num_nodes = G.number_of_nodes()
num_edges = G.number_of_edges()

print(f"Кількість вершин: {num_nodes}")
print(f"Кількість ребер: {num_edges}")

# Ступінь вершин
degree_dict = dict(G.degree())
print("Ступінь вершин:")
for node, degree in degree_dict.items():
    print(f"Вершина {node}: ступінь {degree}")
